
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	Макет = Документы.УчетЗанятий.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетЗанятий.Дата,
	|	УчетЗанятий.ВыполненныеУпражнения.(
	|		НомерСтроки,
	|		Упражнение,
	|		Результат,
	|		Комментарий
	|	)
	|ИЗ
	|	Документ.УчетЗанятий КАК УчетЗанятий
	|ГДЕ
	|	УчетЗанятий.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьВыполненныеУпражненияШапка = Макет.ПолучитьОбласть("ВыполненныеУпражненияШапка");
	ОбластьВыполненныеУпражнения = Макет.ПолучитьОбласть("ВыполненныеУпражнения");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьВыполненныеУпражненияШапка);
		ВыборкаВыполненныеУпражнения = Выборка.ВыполненныеУпражнения.Выбрать();
		Пока ВыборкаВыполненныеУпражнения.Следующий() Цикл
			ОбластьВыполненныеУпражнения.Параметры.Заполнить(ВыборкаВыполненныеУпражнения);
			ТабДок.Вывести(ОбластьВыполненныеУпражнения, ВыборкаВыполненныеУпражнения.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
