
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрогрессВЗале 
	Движения.ПрогрессВЗале.Записывать = Истина;
	Для Каждого ТекСтрокаВыполненныеУпражнения Из ВыполненныеУпражнения Цикл
		Движение = Движения.ПрогрессВЗале.Добавить();
		Движение.Период = Дата;
		Движение.Упражнение = ТекСтрокаВыполненныеУпражнения.Упражнение;
		Движение.Результат = ТекСтрокаВыполненныеУпражнения.Результат;
		Движение.Комментарий = ТекСтрокаВыполненныеУпражнения.Комментарий;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
