
&НаСервере
Процедура ВидУпражненияПриИзмененииНаСервере()
	Если Объект.ВидУпражнения = Справочники.Упражнения.Бег_100_метров ИЛИ Объект.ВидУпражнения = Справочники.Упражнения.Бег_1_км Тогда
		Элементы.ДанныеВремя.Видимость = Истина;
		Элементы.ДанныеКоличество.Видимость = Ложь;
	Иначе
		Элементы.ДанныеВремя.Видимость = Ложь;
		Элементы.ДанныеКоличество.Видимость = Истина;   
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВидУпражненияПриИзменении(Элемент)
	ВидУпражненияПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ДанныеВремя.Видимость = Ложь;   
	Элементы.ДанныеКоличество.Видимость = Ложь; 
КонецПроцедуры
