
&НаКлиенте
Процедура ВыполненныеУпражненияУпражениеПриИзменении(Элемент)
	ТекСтрока = Элементы.ВыполненныеУпражнения.ТекущиеДанные;	
	КЧ = Новый КвалификаторыЧисла(12,2);
	КД = Новый КвалификаторыДаты(ЧастиДаты.Время);         
	
	Если ВидУпражненияВремя(ТекСтрока.Упражнение) Тогда  
		ТекСтрока.Данные = Дата(1, 1, 1);
	Иначе
		ТекСтрока.Данные = 0;
	КонецЕсли;
КонецПроцедуры

Функция ВидУпражненияВремя(ВидУпражнения)
	Возврат ВидУпражнения.ВидДанных = Перечисления.ВидыУпражненией.Время    
 КонецФункции