
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПрогрессВЗале 
	Движения.ПрогрессВЗале.Записывать = Истина;
	Движение = Движения.ПрогрессВЗале.Добавить();
	Движение.Период = Дата;
	Движение.Вид = ВидУпражнения;
	Движение.ДанныеВремя = ДанныеВремя;
	Движение.ДанныеКоличество = ДанныеКоличество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
